[AshBlackIceCodexM1 X2CharacterTemplate]
strCharacterName="Black ICE Codex"

[AshBlackIceCodexM2 X2CharacterTemplate]
strCharacterName="Black ICE Codex"

[AshBlackIceCodexM3 X2CharacterTemplate]
strCharacterName="Black ICE Mother Brain"

[Weapon_AshBlackIceRifleM1 X2WeaponTemplate]
FriendlyName="Black ICE Rifle"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn."
BriefSummary="Lightweight beam rifle carried by the Black ICE Codex."

[Weapon_AshBlackIceRifleM2 X2WeaponTemplate]
FriendlyName="Black ICE Rifle"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn."
BriefSummary="Lightweight beam rifle carried by the Black ICE Codex."

[Weapon_AshBlackIceRifleM3 X2WeaponTemplate]
FriendlyName="Black ICE Rifle"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn."
BriefSummary="Lightweight beam rifle carried by the Black ICE Codex."

[Weapon_AshBlackIceRifleXCom X2WeaponTemplate]
FriendlyName="Black ICE Rifle"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn."
BriefSummary="Lightweight beam rifle carried by the Black ICE Codex."

[Ability_AshBlackIceProtocol X2AbilityTemplate]
locFriendlyName="Black ICE Quarantine"
locLongDescription="<bullet/> Target grants AIM and CRIT bonuses to attackers.\n<bullet/> Target's Hacking Stat greatly reduced.\n<bullet/> Target's Hack Defense greatly reduced.\n<bullet/> Quarantined targets have limited actions."
locHelpText="Quarantine a target with Black Ice, reducing Hacking Stat and increasing AIM and CRIT against it.  Quarantined targets have limited actions."
locFlyOverText="Black ICE Quarantine"

[Ability_AshNetworkFirewallM1 X2AbilityTemplate]
locFriendlyName="Network Firewall"
locLongDescription="<bullet/> Protects the Black ICE Codex from a moderate amount of damage."
locHelpText="Surrounds the Black ICE Codex with an energy shield that absorbs a moderate amount of damage."
locFlyOverText="Network Firewall"

[Ability_AshNetworkFirewallM2 X2AbilityTemplate]
locFriendlyName="Network Firewall"
locLongDescription="<bullet/> Protects the Black ICE Codex from a moderate amount of damage."
locHelpText="Surrounds the Black ICE Codex with an energy shield that absorbs a moderate amount of damage."
locFlyOverText="Network Firewall"

[Ability_AshNetworkFirewallM3 X2AbilityTemplate]
locFriendlyName="Network Firewall"
locLongDescription="<bullet/> Protects the Black ICE Codex from a moderate amount of damage."
locHelpText="Surrounds the Black ICE Codex with an energy shield that absorbs a moderate amount of damage."
locFlyOverText="Network Firewall"

[Ability_AshCounterShot X2AbilityTemplate]
locFriendlyName="Counter Shot"
locLongDescription="<bullet/> Fire a standard shot at a target after taking damage."
locHelpText="Fire a standard shot at a target after taking damage."
locFlyOverText="Counter Shot"

[Ability_AshMalfunction X2AbilityTemplate]
locFriendlyName="Malfunction"
locLongDescription="<bullet/> Fire a standard shot at a target after taking damage."
locHelpText="Fire a standard shot at a target after taking damage."
locFlyOverText="Malfunction"

[Ability_AshCounterDistortionField X2AbilityTemplate]
locFriendlyName="Distortion Field"
locLongDescription="<bullet/> Obscures the Black ICE Codex, increasing defense."
locHelpText="Obscures the Black ICE Codex, increasing defense."
locFlyOverText="Distortion Field"

[Ability_AshCounterTeleport X2AbilityTemplate]
locFriendlyName="Counter Teleport"
locFlyOverText="Teleport"

[Ability_AshCatastrophicFailure X2AbilityTemplate]
locFlyOverText="Catastrophic Failure"

[Ability_AshXcomBlackIceProtocol X2AbilityTemplate]
locFriendlyName="Black ICE Quarantine"
locLongDescription="<bullet/> Target grants AIM and CRIT bonuses to attackers.\n<bullet/> Target's Hacking Stat greatly reduced.\n<bullet/> Target's Hack Defense greatly reduced.\n<bullet/> Quarantined targets have limited actions."
locHelpText="Quarantine a target with Black Ice, reducing Hack Defense and increasing AIM and CRIT against it.  Quarantined targets have limited actions."
locFlyOverText="Black ICE Quarantine"

[UtilityItem_AshBlackIceSkullJack X2WeaponTemplate]
FriendlyName = "Black ICE Skulljack"
TacticalText = "<bullet/> The Black ICE Skulljack is a melee item, requiring the user to be adjacent to their target.\n<bullet/> Though the Black ICE Skulljack places its target in a temporary stasis while network access is granted, once the skulljacking in complete, the target will be automatically terminated."
BriefSummary = "A modified version of our Skulljack that allows us to hijack the ADVENT Network's Black ICE Security Protocol."

[UtilityItem_AshBlackIceRounds X2AmmoTemplate]
FriendlyName = "Black ICE Rounds"
TacticalText = "<bullet/> Infects robotic and tech reliant enemies with a virus causing them to suffer additional damage over time and potentially shuting them down temporarily.\n<bullet/> Infected units have their Hack Defense greatly reduced.\n<bullet/> Infected Black ICE Codex units will malfunction when attempting to Teleport or Shoot after being damaged."
BriefSummary = "A modified version of our Bluescreen Rounds.  These rounds carry a weaponized version of the Black ICE Protocol that Shen has developed.  Upon delivery, the virus is capable of shutting down and causing severe internal damage to robotic and tech reliant enemies."

[Ability_AshDestroyVirusM1 X2AbilityTemplate]
locFriendlyName="Destroy Intruder"
locLongDescription="The Black ICE Codex is capable of unleashing a concentrated blast of energy causing severe injury and damage to the environment"
locHelpText="Fire a concentrated blast of energy causing severe injury and damage to the environment"
locFlyOverText="Destroy Virus"

[Ability_AshDestroyVirusM2 X2AbilityTemplate]
locFriendlyName="Destroy Intruder"
locLongDescription="The Black ICE Codex is capable of unleashing a concentrated blast of energy causing severe injury and damage to the environment"
locHelpText="Fire a concentrated blast of energy causing severe injury and damage to the environment"
locFlyOverText="Destroy Virus"

[Ability_AshDestroyVirusM3 X2AbilityTemplate]
locFriendlyName="Destroy Intruder"
locHelpText="LocHelpText"
locFlyOverText="Destroy Virus"

[Corpse_AshBlackIceCodexBrain X2ItemTemplate]
FriendlyName="Black ICE Encryption"
FriendlyNamePlural="Black ICE Encryptions"
BriefSummary="Due to the Codex's catastrophic failure defensive measure, our soldiers were unable to salvage the entire brain.  They did, however, manage to recover small pieces that still contain a cache of encrypted data.  Nothing short of complete disintegration is safeguard enough to protect all of the aliens' secrets."

[Autopsy_AshBlackIceCodexBrain X2TechTemplate]
DisplayName="Black ICE Encryption"
Summary="It would appear that the aliens have increased the security protocols of the ADVENT network in an attempt to block our intrusion attempts. With further analysis, we should be able to decode the security protocols implemented by the Black ICE Codex.  If successful, I have no doubt that we can use our findings to exploit, currently unknown, vulnerabilities in the network."
CodeName="ICE"
LongDescription="We have been able to break through the conventional algorithms and matrix of biological signatures woven into this cipher.  Much like an anti-virus, the Black ICE Codex is designed to not only identify and remove intruders from the ADVENT Network, but also assist to destroy them, literally, even beyond the context of cyberspace.\n\nIt would appear that the aliens have invested heavily in new techniques to safeguard the ADVENT network. Now that we have access to such a protocol, I see no reason why we shouldn't use it to our own advantage. R. Tygan."

[ProvingGroundsProject_AshBlackIceSkulljack X2TechTemplate]
DisplayName="Black ICE Skulljack"
Summary="A modified version of our Skulljack.  Once complete, we should be able to use the ADVENT network's Black ICE Security Protocol against the aliens."
LongDescription="LongDescription"

[ProvingGroundsProject_AshBlackIceRounds X2TechTemplate]
DisplayName="Black ICE Rounds"
Summary="By modifying one of our Bluescreen Rounds to carry a weaponized version of the Black ICE Protocol that Shen has developed, our soldiers will pose a considerable threat to ADVENT robotic units and tech reliant aliens."
LongDescription="LongDescription"

[Research_AshBlackIceRifleXcom X2TechTemplate]
DisplayName="Black ICE Rifle"
CodeName="Deep Freeze"
Summary="Summary"
LongDescription="LongDescription"